---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentWarning
source: html/3d6f0d5d-fa47-adac-3c9c-fa4f1c4691d1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentWarning Property

The solution is failing to do segments which are zero length.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZeroLengthSegmentWarning { get; }
```